Repository: abreuretto72/ScanNutPlus
Catalog: lib/features/pet/l10n/pet_*.arb
Languages: pt

# pet_capture_title
source: Pet Capture
pt: Captura Pet

# pet_capture_instructions
source: The AI analyzes images of the pet, wounds, stool, mouth, eyes, and skin. One at a time.
pt: A IA analisa imagens do pet, da ferida, das fezes, da boca, dos olhos e da pele. Uma de cada vez.

# pet_saved_success
source: Pet saved successfully
pt: Pet salvo com sucesso

# pet_analysis_error
source: Analysis failed
pt: Falha na análise

# pet_history_empty
source: No history found
pt: Nenhum histórico encontrado

# pet_tab_history
source: History
pt: Histórico

# pet_tab_capture
source: Capture
pt: Capturar

# pet_label_species
source: Species
pt: Espécie

# pet_label_dog
source: Dog
pt: Cão

# pet_label_cat
source: Cat
pt: Gato

# pet_result_title
source: Analysis Result
pt: Resultado da Análise

# pet_section_observations
source: Visual Observations
pt: Observações Visuais

# pet_section_sources
source: Consulted Sources
pt: Fontes Consultadas

# pet_disclaimer
source: The analysis is visual only and does not replace veterinary evaluation.
pt: A análise é apenas visual e não substitui avaliação veterinária.

# pet_action_share
source: Share with Vet
pt: Compartilhar com Vet

# pet_action_new_analysis
source: New Analysis
pt: Nova Análise

# pet_footer_text
source: Result Page | Â© 2026 Multiverso Digital
pt: Página de Resultado | © 2026 Multiverso Digital

# pet_action_analyze
source: Analyze Now
pt: Analisar Agora

# pet_status_analyzing
source: Analyzing...
pt: Analisando...

# pet_voice_title
source: Voice Identification
pt: Identificação Vocal

# pet_voice_instruction
source: New friend detected! Say name, sex, weight, and age.
pt: Novo amigo detectado! Qual o nome, sexo, peso e idade?

# pet_voice_hint
source: Ex: Thor, Male, 12kg, 4 years
pt: Ex: Thor, Macho, 12kg, 4 anos

# pet_voice_action
source: Send Voice
pt: Enviar Voz

# pet_voice_retry
source: Retry
pt: Tentar Novamente

# pet_rag_new_identity
source: Identity saved: {name}
pt: Identidade salva: {name}

# pet_analysis_for
source: Analysis: {name}
pt: Análise: {name}

# pet_voice_who_is_this
source: Who is this pet?
pt: Quem é este pet?
