Repository: abreuretto72/ScanNutPlus
Catalog: lib/l10n/app_*.arb
Languages: pt

# pet_nutrition_gestating
source: Gestating/Lactating
pt: Gestante/Lactante

# pet_nutrition_athlete
source: Athlete/Work
pt: Atleta/Trabalho

# pet_nutrition_recovery
source: Recovery
pt: Recuperação

# pet_nutrition_every_day
source: EVERY DAY:
pt: TODOS OS DIAS:

# pet_error_nutrition_plan
source: Error generating nutritional plan.
pt: Erro ao gerar plano nutricional.

# pet_error_summary
source: We couldn't generate the summary right now. Please try again later.
pt: Não foi possível gerar o resumo no momento. Tente novamente mais tarde.

# pet_health_based_on_history
source: Based on Pet's Clinical History
pt: Baseado no Histórico Clínico do Pet

# pet_metric_last_recorded
source: Last: {value}
pt: Último: {value}

# pet_metric_evolution_title
source: Evolution: {label}
pt: Evolução: {label}

# pet_metric_save_quick
source: Save {metric}
pt: Salvar {metric}

# pet_metric_empty_state
source: No records
pt: S/ Reg.

# pet_metric_quick_action_title
source: Quick Actions
pt: Ações Rápidas

# pet_error_no_internet_title
source: No Internet Connection
pt: Sem Conexão com a Internet

# pet_error_no_internet_content
source: Oops! It looks like your phone is offline or the signal dropped. Please check your internet connection and try again.
pt: Ops! Parece que o seu celular está sem internet ou o sinal caiu. Verifique a sua conexão e clique em tentar novamente.

# pet_error_timeout_title
source: Server Busy
pt: Servidor Ocupado

# pet_error_timeout_content
source: The AI took too long to respond this time. This usually happens when the server is busy. Please wait a few seconds and try again.
pt: A Inteligência Artificial demorou muito para responder desta vez. Isso acontece quando há muitos acessos ao mesmo tempo. Por favor, aguarde alguns segundos e tente novamente.

# pet_error_technical_title
source: Unable to Analyze
pt: Não foi possível analisar

# pet_error_technical_content
source: We encountered a small technical issue while reading your data. Don't worry, just try again.
pt: Tivemos uma pequena falha técnica ao analisar seus dados. Não se preocupe, pode tentar novamente.

# pet_analysis_title
source: New Profile: {name}
pt: Novo Perfil: {name}

# pet_journal_bg_evaluating
source: Analyzing in background...
pt: Analisando em 2º plano...

# pet_journal_bg_ready
source: Analysis Ready - Summary below
pt: Análise Pronta - Resumo abaixo

# pet_journal_bg_error
source: Analysis Error
pt: Erro na análise

# pet_journal_bg_saved
source: Media saved. Analyzing...
pt: Mídia salva. Analisando...

# pet_journal_bg_resuming
source: Resuming intelligence evaluations... ({count})
pt: Resumindo avaliações da inteligência... ({count})

# pet_journal_bg_fatal
source: Critical error in background processing.
pt: Erro Crítico no processamento em tela de fundo.

# pet_journal_bg_save_fail
source: Failed to save event to database.
pt: Falha ao gravar evento no banco de dados.

# pet_journal_saved_friend
source: Friend Event Saved in Agenda!
pt: Evento de Amigo Salvo na Agenda!

# pet_journal_saved_own
source: Event Saved!
pt: Evento Salvo!

# pet_journal_friend_label
source: Friend
pt: Amigo

# agenda_voice_greeting
source: Beli, what are we scheduling for your pet?
pt: Beli, o que vamos agendar para o seu pet?

# agenda_voice_success_prompt
source: I filled in the details for you. Is everything correct or do you want to adjust something?
pt: Preenchi os detalhes para você. Está tudo correto ou quer ajustar algo?

# agenda_voice_listening
source: Beli is listening...
pt: Beli está escutando...

# agenda_voice_processing
source: Processing...
pt: Processando...

# agenda_field_category
source: Category
pt: Categoria

# agenda_field_date
source: Date
pt: Data

# agenda_field_time
source: Time
pt: Hora

# agenda_field_desc
source: Description
pt: Descrição

# agenda_btn_save
source: SAVE
pt: SALVAR

# agenda_error_voice
source: I couldn't understand, try typing.
pt: Não consegui entender, tente digitar.

# pet_agenda_attach_document
source: Attach Document
pt: Anexar Documento

# pet_agenda_ai_summary
source: Generate AI Summary
pt: Gerar Resumo IA

# pet_agenda_generating_summary
source: Generating Summary...
pt: Gerando Resumo...

# pet_agenda_file_attached
source: File Attached
pt: Arquivo Anexado

# pet_agenda_ai_summary_attached
source: AI Summary Attached
pt: Resumo IA Anexado

# pet_journal_bg_processing
source: Processing AI Media...
pt: Processando Mídia IA...

# pet_agenda_delete_attachment_title
source: Delete Attachment
pt: Excluir Anexo

# pet_agenda_delete_attachment_msg
source: Are you sure you want to delete this attachment?
pt: Tem certeza que deseja remover este anexo?

# pet_agenda_delete_attachment_confirm
source: Delete
pt: Excluir

# pet_metric_pdf_filter_title
source: Metrics Report
pt: Relatório de Métricas

# pet_metric_pdf_filter_subtitle
source: Select the period to generate the PDF
pt: Selecione o período para gerar o PDF

# pet_metric_pdf_filter_last_7_days
source: Last 7 days
pt: Últimos 7 dias

# pet_metric_pdf_filter_last_30_days
source: Last 30 days
pt: Últimos 30 dias

# pet_metric_pdf_filter_last_3_months
source: Last 3 months
pt: Últimos 3 meses

# pet_metric_pdf_filter_all_time
source: All time
pt: Todo o período

# pet_metric_pdf_filter_custom
source: Custom
pt: Personalizado

# pet_metric_pdf_filter_start_date
source: Start Date
pt: Data Inicial

# pet_metric_pdf_filter_end_date
source: End Date
pt: Data Final

# pet_metric_pdf_filter_generate
source: Generate PDF
pt: Gerar PDF

# pet_metric_pdf_filter_cancel
source: Cancel
pt: Cancelar

# pet_metric_pdf_table_value
source: Value
pt: Valor

# pet_metric_pdf_empty_data
source: No records found in this period.
pt: Nenhum registro encontrado neste período.

# pet_record_date_label
source: Date
pt: Data

# pet_expense_dashboard_title
source: Expense Monitoring
pt: Monitoramento de Despesas

# pet_expense_dashboard_empty
source: No expenses recorded in this period yet. How about recording your pet's first treat?
pt: Ainda não há despesas registradas neste período. Que tal registrar o primeiro mimo do seu pet?

# pet_expense_chart_pie_title
source: Distribution by Category
pt: Distribuição por Categoria

# pet_expense_chart_line_title
source: Monthly Evolution
pt: Evolução Mensal

# pet_expense_chart_area_title
source: Total Accumulation
pt: Acúmulo Total

# pet_expense_filter_month
source: Month
pt: Mês

# pet_expense_filter_year
source: Year
pt: Ano

# pet_expense_filter_all
source: All
pt: Todos

# pet_expense_cat_food
source: Food
pt: Alimentação

# pet_expense_cat_health
source: Health
pt: Saúde

# pet_expense_cat_hygiene
source: Hygiene & Aesthetics
pt: Higiene & Estética

# pet_expense_cat_meds
source: Medication
pt: Medicamentos

# pet_expense_cat_treats
source: Treats & Leisure
pt: Mimos & Lazer

# pet_expense_cat_services
source: Extra Services
pt: Serviços Extras

# menu_backup
source: Backup & Restore
pt: Backup e Restauração

# backup_title
source: Data Backup
pt: Backup de Segurança

# backup_desc
source: Protect your data by exporting it safely or restore an existing backup.
pt: Proteja seus dados exportando-os com segurança ou restaure um backup existente.

# backup_local_btn
source: Save Local Backup
pt: Salvar Backup Local

# backup_cloud_btn
source: Share External Backup
pt: Compartilhar Backup Externo

# backup_restore_btn
source: Restore Database
pt: Restaurar Banco de Dados

# backup_success
source: Backup executed successfully!
pt: Backup executado com sucesso!

# backup_error
source: Failed to backup: {error}
pt: Falha ao realizar backup: {error}

# backup_file_saved
source: Backup saved at: {path}
pt: Backup salvo em: {path}

# backup_confirm_restore_title
source: ⚠️ Overwrite Database
pt: ⚠️ Sobrescrever Banco de Dados

# backup_confirm_restore_msg
source: This will erase current data and replace it with the backup. The app will log you out. Continue?
pt: Isso vai apagar os dados atuais e substituí-los pelo arquivo de backup. O aplicativo será desconectado se prosseguir. Deseja continuar?

# backup_restore_success
source: Restore complete! Log in again.
pt: Restauração concluída! Entre novamente.

# backup_restore_error
source: Restore failed: {error}
pt: Erro ao tentar restaurar: {error}

# tutorial_pet_info_title
source: Pet Information
pt: Informações do Pet

# tutorial_pet_info_desc
source: Here is your pet's Name, Breed, and Photo. Tap anywhere on the card to open the Full Dashboard.
pt: Aqui estão o Nome, a Raça e a Foto do seu pet. Toque em qualquer parte do cartão para abrir o Painel Completo (Dashboard).

# tutorial_pet_ai_title
source: AI Assistant
pt: Assistente IA

# tutorial_pet_ai_desc
source: This is where you access your Pet's exclusive AI. The AI answers everything about your pet.
pt: É por aqui que você tem acesso à IA exclusiva do seu Pet. A IA responde tudo sobre o pet.

# tutorial_pet_actions_title
source: Quick Actions
pt: Ações Rápidas

# tutorial_pet_actions_desc
source: Access past Analyses, start tracked Walks, open the Agenda, or edit the Profile.
pt: Acesse Análises antigas, inicie Passeios monitorados, abra a Agenda ou edite o Perfil.

# tutorial_pet_action_analyses_title
source: Analyses History
pt: Análises

# tutorial_pet_action_analyses_desc
source: Access to perform analyses on images, labels, exams, barks, meows, and videos of your pet. There are several analyses. Check them out.
pt: Acesso para realizar análises de imagens, rótulos, exames, latidos, miados e videos do seu pet. São várias análises. Confira.

# tutorial_pet_action_walk_title
source: Walk Tracking
pt: Passeios

# tutorial_pet_action_walk_desc
source: Record your pet's walk by doing photo analyses along the route. An orientation map will assist you on your walk.
pt: Registre o passeio do seu pet fazendo análises via fotos durante o trajeto. Um mapa de orientação ajudará no seu passeio.

# tutorial_pet_action_agenda_title
source: Integrated Agenda
pt: Agenda Integrada

# tutorial_pet_action_agenda_desc
source: Schedule your pet's appointments. The agenda is the engine of the app, recording everything that happens with your pet. Log clinical metrics, expenses, Energy, Appetite, medication, incidents, and others.
pt: Marque compromissos do seu pet. A agenda é o motor do app registrando tudo o que acontece com o seu pet. Registre méticas clinicas, despesas, Energia, Apetite, medicação, incidentes e outros.

# tutorial_pet_action_nutrition_title
source: Health & Nutrition
pt: Clínico e Nutrição

# tutorial_pet_action_nutrition_desc
source: Generate nutritional plans for your pet with meal suggestions for a week. Kibble only, natural food only, or hybrid.
pt: Gere planos nutricionais para o seu pet com sugestões de refeições para uma semana. Só ração, só alimentos naturais ou híbrida.

# tutorial_pet_action_profile_title
source: Profile
pt: Perfil

# tutorial_pet_action_profile_desc
source: Edit your pet's name, breed, date of birth, and other details.
pt: Edite nome, raça, data de nascimento e demais dados.

# tutorial_skip
source: SKIP
pt: PULAR

# tutorial_next
source: NEXT
pt: PRÓXIMO

# tutorial_finish
source: GOT IT
pt: ENTENDI
