Repository: abreuretto72/ScanNutPlus
Catalog: lib/l10n/app_*.arb
Languages: pt

# label_video
source: Video
pt: Vídeo

# error_file_too_large
source: This file is too large (Max 20MB).
pt: Arquivo muito grande (Máx 20MB).

# error_video_too_long
source: Max 60s
pt: Máx 60s

# keywordFriend
source: Friend
pt: Amigo

# keywordGuest
source: Guest
pt: Convidado

# pet_module_dentistry_programs
source: Tartar, Gingivitis, Broken Teeth
pt: Tártaro, Gengivite, Dentes Quebrados

# pet_module_dermatology_programs
source: Alopecia, Dermatitis, Wounds, Parasites
pt: Alopecias, Dermatites, Feridas, Parasitas

# pet_module_gastro_programs
source: Consistency, Color, Parasites, Blood
pt: Consistência, Cor, Parasitas, Sangue

# pet_module_ophthalmology_programs
source: Secretion, Redness, Cataracts, Spots
pt: Secreção, Vermelhidão, Catarata, Manchas

# pet_module_otology_programs
source: Wax, Itching, Odor, Redness
pt: Cera, Coceira, Odor, Vermelhidão

# pet_module_physique_programs
source: Body Score, Muscle Mass, Obesity
pt: Escore Corporal, Massa Muscular, Obesidade

# pet_module_lab_programs
source: CBC, Biochemistry, Urine, Stool
pt: Hemograma, Bioquímico, Urina, Fezes

# pet_module_nutrition_programs
source: Label Analysis, Nutritional Table
pt: Análise de Rótulos, Tabela Nutricional

# pet_module_vocal
source: Vocal
pt: Vocalização

# pet_module_vocal_programs
source: Barks, Meows, Coughs, Breathing
pt: Latidos, Miados, Tosse, Respiração

# pet_module_behavior
source: Behavior
pt: Comportamento

# pet_module_behavior_programs
source: Breed, Posture, Anxiety, Tremors
pt: Raça, Postura, Ansiedade, Tremores

# pet_error_ai_unhandled_format
source: The AI generated a complex response on this attempt. Please click analyze again.
pt: A inteligência artificial gerou uma resposta complexa demais nesta tentativa. Por favor, clique em analisar novamente.

# pet_module_plant
source: Plants
pt: Plantas

# pet_module_plant_programs
source: Toxic Plant Identification
pt: Identificação de Plantas Tóxicas

# pet_module_food_bowl
source: Food Bowl
pt: Alimentação

# pet_module_food_bowl_programs
source: Kibble Quality, Natural Food
pt: Qualidade da Ração, Comida Natural

# action_record_video_audio
source: Record Audio/Video
pt: Gravar

# action_select_audio
source: Select Audio
pt: Escolher Áudio

# action_upload_video_audio
source: Upload File
pt: Carregar

# pet_mode_my_pet
source: My Pet
pt: Meu Pet

# pet_mode_friend
source: Friend Pet
pt: Pet Amigo

# pet_label_tutor
source: Tutor Name
pt: Tutor

# pet_hint_select_friend
source: Select
pt: Selecione

# pet_new_friend_option
source: New Friend
pt: Novo Amigo

# pet_friend_list_label
source: Friend List
pt: Amigos

# pet_error_fill_friend_fields
source: Fill all.
pt: Preencha tudo.

# pet_result_title_my_pet
source: My Pet: {name}
pt: Meu Pet: {name}

# pet_result_title_friend_pet
source: Friend Pet: {name} (Tutor: {tutor})
pt: Amigo: {name}

# pet_action_edit_friend
source: Edit Friend
pt: Editar

# pet_action_delete_friend
source: Delete Friend
pt: Excluir

# pet_msg_confirm_delete_friend
source: Are you sure you want to delete this friend?
pt: Excluir amigo?

# pet_msg_friend_updated
source: Friend updated successfully!
pt: Atualizado!

# pet_msg_friend_deleted
source: Friend deleted successfully!
pt: Excluído!

# pet_dialog_edit_title
source: Edit Friend Pet
pt: Editar Amigo

# pet_plant_toxic
source: TOXIC ⚠️
pt: TÓXICA ⚠️

# pet_plant_safe
source: SAFE ✅
pt: SEGURA ✅

# pet_msg_confirm_delete_entry
source: Are you sure you want to delete this analysis?
pt: Excluir análise?

# pet_journal_audio_saved_success
source: Audio saved!
pt: Áudio salvo!

# pet_journal_photo_saved_success
source: Photo saved!
pt: Foto salva!

# pet_journal_video_saved_success
source: Video saved!
pt: Vídeo salvo!

# pet_profile_title_simple
source: Profile
pt: Perfil

# pet_action_save_profile_simple
source: Save
pt: Salvar

# funeral_save_success_simple
source: Funeral saved!
pt: Funeral salvo!

# health_plan_saved_success_simple
source: Health plan saved!
pt: Saúde salvo!

# pdf_page_label
source: Page
pt: Página

# pdf_of_label
source: of
pt: de

# pet_agenda_dialog_walk
source: Walk
pt: Passeio

# pet_agenda_dialog_appointment
source: Schedule
pt: Agendar

# pet_appointment_screen_title
source: New Appointment
pt: Novo Compromisso

# pet_appointment_label_professional
source: Professional/Place
pt: Profissional/Local

# pet_appointment_save_success
source: Appointment scheduled!
pt: Compromisso agendado!

# pet_appointment_type_vaccine
source: Vaccine
pt: Vacina

# pet_appointment_type_consultation
source: Consultation
pt: Consulta

# pet_appointment_type_grooming
source: Grooming
pt: Banho e Tosa

# pet_appointment_type_exam
source: Exam
pt: Exame

# pet_scheduled_list_title
source: Scheduled
pt: Agendamentos

# pet_scheduled_empty
source: No future appointments.
pt: Nenhum compromisso futuro.

# pet_notification_label
source: Notify in Advance
pt: Notificar com Antecedência

# pet_notification_1h
source: 1 hour before
pt: 1 hora antes

# pet_notification_2h
source: 2 hours before
pt: 2 horas antes

# pet_notification_1d
source: 1 day before
pt: 1 dia antes

# pet_notification_2d
source: 2 days before
pt: 2 dias antes

# pet_notification_1w
source: 1 week before
pt: 1 semana antes

# pet_notification_none
source: No notification
pt: Sem notificação

# pet_delete_confirmation_title
source: Are you sure you want to delete?
pt: Confirmar exclusão?

# pet_appointment_tab_data
source: Appointment
pt: Compromisso

# pet_appointment_tab_partner
source: Partners
pt: Parceiros

# pet_appointment_edit
source: Edit Appointment
pt: Editar Agendamento

# pet_appointment_outcome
source: Register Outcome
pt: Registrar Desfecho

# pet_appointment_outcome_title
source: Event Outcome
pt: Desfecho do Evento

# pet_appointment_outcome_hint
source: What happened during the appointment? Add notes, recommendations, etc.
pt: O que aconteceu no compromisso? Adicione notas, recomendações, etc.

# pet_appointment_outcome_save
source: Save Outcome
pt: Salvar Desfecho

# pdf_button_generate
source: Generate PDF
pt: Gerar PDF

# common_save
source: Save
pt: Salvar

# source_analysis
source: Analysis
pt: Análise

# source_walk
source: Walk
pt: Passeio

# source_appointment
source: Appointment
pt: Compromisso

# source_nutrition
source: Nutrition
pt: Nutrição

# source_health
source: Health
pt: Saúde

# source_profile
source: Profile
pt: Perfil

# source_journal
source: Journal
pt: Diário

# pet_plan_nutritional
source: Nutritional Plan
pt: Plano Nutricional

# pet_walk_summary_dialog_title
source: Walk Summary 🐾
pt: Resumo do Passeio 🐾

# pet_walk_summary_dialog_desc
source: Select the interval to generate AI summary.
pt: Selecione o intervalo para gerar o resumo com IA.

# pet_label_start
source: Start
pt: Início

# pet_label_end
source: End
pt: Fim

# pet_action_generate_summary
source: Generate Summary
pt: Gerar Resumo

# pet_error_fetch_events
source: Error fetching events.
pt: Erro ao buscar eventos.

# pet_error_no_events_period
source: No events found in this period.
pt: Nenhum evento encontrado neste período.

# pet_msg_summary_success
source: Summary generated and saved successfully! 🐾
pt: Resumo gerado e salvo com sucesso! 🐾

# pet_walk_empty_history
source: No walks recorded.
pt: Nenhum passeio registrado.

# pet_walk_summary_title_generated
source: Summary {start} - {end}
pt: Resumo {start} - {end}

# pet_msg_google_simulated
source: Google Data (Simulated) added!
pt: Dados do Google (Simulados) adicionados!

# pet_nutrition_copy_action
source: Copy meals to agenda
pt: Copiar refeições para agenda

# pet_nutrition_select_start_date
source: Select start date (Monday)
pt: Selecione a data de início (Segunda-feira)

# pet_nutrition_copy_success
source: Meals copied to agenda!
pt: Refeições copiadas para a agenda!

# pet_nutrition_copy_error
source: Error copying. Check plan format.
pt: Erro ao copiar. Verifique o formato do plano.

# pet_appointment_type_vermifuge
source: Deworming/Flea Control
pt: Vermifugação/Antipulgas

# pet_appointment_type_medication
source: Continuous Medication
pt: Medicação Contínua

# pet_appointment_type_training
source: Training
pt: Adestramento/Treino

# pet_appointment_type_daycare
source: Daycare
pt: Creche/Daycare

# pet_appointment_type_nails_ears
source: Nails/Ears Cleaning
pt: Corte de Unhas/Ouvidos

# pet_appointment_type_dental
source: Teeth Brushing
pt: Escovação de Dentes

# pet_appointment_type_food_change
source: Food Change
pt: Troca de Ração

# pet_appointment_type_travel
source: Pet Friendly Travel
pt: Viagem Pet Friendly

# pet_appointment_type_accessories
source: Accessories Change
pt: Troca de Acessórios

# pet_appointment_cat_health
source: Health (Essential)
pt: Saúde (Essencial)

# pet_appointment_cat_wellness
source: Wellness & Aesthetics
pt: Bem-estar & Estética

# pet_appointment_cat_behavior
source: Behavior & Training
pt: Comportamento & Treino

# pet_appointment_cat_services
source: Extra Services
pt: Serviços Extras

# pet_appointment_cat_nutrition
source: Nutrition
pt: Nutrição

# pet_appointment_cat_docs
source: Documentation
pt: Documentação

# pet_apt_consultation_general
source: General Practitioner
pt: Clínica Geral

# pet_apt_consultation_return
source: Follow-up
pt: Retorno

# pet_apt_consultation_specialist
source: Specialist
pt: Especialista

# pet_apt_consultation_tele
source: Teleconsultation
pt: Teleconsulta

# pet_apt_vaccine_annual
source: Annual Vaccine
pt: Vacina Anual

# pet_apt_vaccine_specific
source: Specific Vaccine
pt: Vacina Específica

# pet_apt_vaccine_booster
source: Booster
pt: Reforço

# pet_apt_exam_blood
source: Complete Blood Count
pt: Hemograma

# pet_apt_exam_ultrasound
source: Ultrasound
pt: Ultrassom

# pet_apt_exam_xray
source: X-Ray
pt: Raio-X

# pet_apt_exam_lab
source: Lab Exam
pt: Laboratorial

# pet_apt_exam_periodic
source: Periodic
pt: Periódico

# pet_apt_procedure_castration
source: Neutering/Spaying
pt: Castração

# pet_apt_procedure_surgery
source: Surgery
pt: Cirurgia

# pet_apt_procedure_dental
source: Dental Cleaning
pt: Limpeza Dentária

# pet_apt_procedure_dressing
source: Dressing Change
pt: Curativos

# pet_apt_treatment_physio
source: Physiotherapy
pt: Fisioterapia

# pet_apt_treatment_acu
source: Acupuncture
pt: Acupuntura

# pet_apt_treatment_chemo
source: Chemotherapy
pt: Quimioterapia

# pet_apt_treatment_hemo
source: Hemodialysis
pt: Hemodiálise

# pet_apt_wellness_bath
source: Bath
pt: Banho

# pet_apt_wellness_grooming
source: Grooming
pt: Tosa

# pet_apt_wellness_hygienic
source: Hygienic Trim
pt: Tosa Higiênica

# pet_apt_wellness_hydration
source: Hydration
pt: Hidratação

# pet_apt_wellness_hotel
source: Pet Hotel
pt: Hotelzinho

# pet_apt_behavior_training
source: Training
pt: Adestramento

# pet_apt_behavior_evaluation
source: Behavioral Eval
pt: Avaliação Comportamental

# pet_apt_behavior_social
source: Socialization
pt: Socialização

# pet_apt_service_taxi
source: Pet Taxi
pt: Táxi Pet

# pet_apt_service_delivery
source: Food Delivery
pt: Entrega Ração

# pet_apt_nutrition_meal
source: Meal
pt: Refeição

# pet_apt_nutrition_food_change
source: Food Change
pt: Troca de Ração

# pet_apt_service_nutrition
source: Nutrition Consult
pt: Consulta Nutricional

# pet_apt_service_mealplan
source: Meal Plan
pt: Plano Alimentar

# pet_apt_doc_vaccine_card
source: Vaccine Card Renewal
pt: Renovação Carteirinha

# pet_apt_doc_health_cert
source: Health Certificate
pt: Atestado de Saúde

# pet_apt_doc_microchip
source: Microchipping
pt: Microchipagem

# pet_apt_doc_gta
source: Animal Transit Guide
pt: Emissão GTA

# pet_apt_doc_travel
source: Travel Docs
pt: Docs Viagem

# pet_apt_select_category
source: Category
pt: Categoria

# pet_apt_select_type
source: Appointment Type
pt: Tipo de Agendamento

# source_friend
source: Friend
pt: Amigo

# pet_title_ophthalmology
source: Ophthalmology
pt: Oftalmologia

# pet_title_dental
source: Dental Health
pt: Saúde Bucal

# pet_title_dermatology
source: Skin & Coat
pt: Pele e Pelagem

# pet_title_ears
source: Ears
pt: Ouvidos

# pet_title_digestion
source: Digestion
pt: Digestão

# pet_title_body_condition
source: Body Condition
pt: Condição Corporal

# pet_title_vocalization
source: Vocalization
pt: Vocalização

# pet_title_behavior
source: Behavior
pt: Comportamento

# pet_title_walk
source: Walk
pt: Passeio

# pet_title_ai_chat
source: AI Chat
pt: Chat IA

# pet_title_nutrition
source: Nutrition
pt: Nutrição

# pet_title_lab
source: Laboratory
pt: Laboratório

# pet_title_label_analysis
source: Label Analysis
pt: Análise de Rótulo

# pet_title_plants
source: Plants
pt: Plantas

# pet_title_initial_eval
source: New Profile
pt: Novo Perfil

# pet_title_health_summary
source: Health Summary
pt: Resumo de Saúde

# pet_title_general_checkup
source: General Check-up
pt: Check-up Geral

# pet_title_clinical_summary
source: Clinical Summary
pt: Resumo Clínico

# pet_action_nutrition
source: Nutrition
pt: Nutrição

# pet_nutrition_screen_title
source: Nutrition
pt: Nutrição

# pet_title_planned_meal
source: Planned Meal
pt: Refeição Planejada

# pet_record_medication
source: Medication
pt: Medicação

# pet_record_weight
source: Weight
pt: Peso

# pet_record_energy
source: Energy
pt: Energia

# pet_record_appetite
source: Appetite
pt: Apetite

# pet_record_incident
source: Incidents
pt: Incidentes

# pet_record_expense
source: Expenses
pt: Despesas

# pet_expense_history_title
source: Expense History
pt: Histórico de Despesas

# pet_expense_history_empty
source: No expenses recorded.
pt: Nenhuma despesa registrada.

# pet_expense_history_item_deleted
source: Expense deleted
pt: Despesa excluída

# pet_record_other
source: Others
pt: Outros

# pet_field_drug_name
source: Drug Name
pt: Nome do Remédio

# pet_field_category
source: Category
pt: Categoria

# pet_field_dosage
source: Dosage
pt: Dosagem

# pet_field_unit
source: Unit
pt: Unidade

# pet_field_time
source: Actual Time
pt: Horário Real

# pet_field_amount_money
source: Amount
pt: Valor

# pet_field_currency
source: Currency
pt: Moeda

# pet_field_observation
source: Observation
pt: Observação

# pet_field_mass
source: Mass
pt: Massa

# pet_field_location
source: Location
pt: Local

# pet_field_energy_level
source: Level
pt: Nível

# pet_field_period
source: Period
pt: Período

# pet_field_context
source: Context
pt: Contexto

# pet_field_consumption
source: Consumption
pt: Consumo

# pet_field_thirst
source: Thirst
pt: Sede

# pet_field_diet_variation
source: Diet Variation
pt: Variação Dieta

# pet_field_severity
source: Severity
pt: Gravidade

# pet_field_description
source: Description
pt: Descrição

# pet_field_symptoms
source: Symptoms
pt: Sintomas

# pet_field_action_taken
source: Action Taken
pt: Ação Tomada

# pet_field_type
source: Type
pt: Tipo

# pet_field_details
source: Details
pt: Detalhes

# pet_opt_continuous
source: Continuous
pt: Contínuo

# pet_opt_wormer
source: Dewormer
pt: Vermífugo

# pet_opt_flea
source: Flea Control
pt: Antipulgas

# pet_opt_antibiotic
source: Antibiotic
pt: Antibiótico

# pet_opt_low
source: Low/Apathetic
pt: Baixo/Apático

# pet_opt_active
source: Active
pt: Ativo

# pet_opt_hyper
source: Hyperactive
pt: Hiperativo

# pet_opt_morning
source: Morning
pt: Manhã

# pet_opt_afternoon
source: Afternoon
pt: Tarde

# pet_opt_night
source: Night
pt: Noite

# pet_opt_all_day
source: All Day
pt: Dia Inteiro

# pet_opt_none
source: None
pt: Nada

# pet_opt_half
source: Half
pt: Metade

# pet_opt_all
source: All
pt: Tudo

# pet_opt_reduced
source: Reduced
pt: Diminuída

# pet_opt_excessive
source: Excessive
pt: Excessiva

# pet_opt_mild
source: Mild
pt: Leve

# pet_opt_moderate
source: Moderate
pt: Moderada

# pet_opt_urgent
source: Urgent
pt: Urgente

# pet_opt_hygiene
source: Hygiene
pt: Higiene

# pet_opt_estrus
source: Estrus/Reproduction
pt: Cio/Reprodução

# pet_record_save_success
source: Record saved successfully!
pt: Registro salvo com sucesso!

# pet_record_save_error
source: Error saving record.
pt: Erro ao salvar registro.

# help_pillar_analysis_title
source: Image and Video Analysis
pt: Análises de Imagens e Vídeos

# help_pillar_analysis_desc
source: Our AI processes photos and videos to identify subtle signs of health, posture, and behavior in your pet.
pt: Nossa IA processa fotos e vídeos para identificar sinais sutis de saúde, postura e comportamento do seu pet.

# help_pillar_walks_title
source: Walk Monitoring
pt: Monitoramento de Passeios

# help_pillar_walks_desc
source: Record of what happens during walks, monitoring energy levels, interactions, and predictive routes.
pt: Registro do que ocorre nos passeios, monitorando níveis de energia, interações e trajetos preditivos.

# help_pillar_agenda_title
source: Agenda and Occurrences
pt: Agenda e Ocorrências

# help_pillar_agenda_desc
source: Central hub for appointments and daily records: medication, weight, incidents, and analysis history in one place.
pt: Central de compromissos e registros diários: medicação, peso, incidentes e histórico de análises em um só lugar.

# help_pillar_nutrition_title
source: Smart Nutrition
pt: Nutrição Inteligente

# help_pillar_nutrition_desc
source: Generation of personalized menus and automatic inclusion of meals in the daily agenda for consumption tracking.
pt: Geração de cardápios personalizados e inclusão automática das refeições na agenda para controle de consumo.

# help_pillar_profile_title
source: Profile and Documentation
pt: Perfil e Documentação

# help_pillar_profile_desc
source: Pet data, health plans, funeral plans, and storage of important documents for quick access.
pt: Dados do pet, planos de saúde, funerário e armazenamento de documentos importantes para acesso rápido.

# pet_agenda_tab_history_label
source: History
pt: Histórico

# pet_agenda_tab_records
source: Records
pt: Registros

# pet_field_partner_name
source: Place/Professional Name
pt: Nome do Local/Profissional

# pet_field_contact_person
source: Contact Person
pt: Pessoa de Contato

# pet_field_phone
source: Phone
pt: Telefone

# ai_disclaimer_footer
source: 💡 Analysis generated by Gemini technology. Always consult a specialist.
pt: 💡 Análise gerada pela tecnologia Gemini. Consulte sempre um especialista.

# pet_agenda_edit_btn
source: Edit
pt: Editar

# pet_agenda_outcome_btn
source: Outcome
pt: Resultado

# pet_field_what_to_do
source: What to do?
pt: O que vai fazer?

# pet_field_what_was_done
source: What was done?
pt: O que foi feito?

# pet_agenda_outcome_title
source: Outcome
pt: Resultado/Desfecho

# pet_agenda_outcome_hint
source: How did it proceed after the analysis? Did it get worse? Better?
pt: Como procedeu após a análise? Piorou? Melhorou?

# pet_agenda_outcome_prefix
source: Outcome
pt: Desfecho

# pet_friend_name_label
source: Friend's Name (Pet)
pt: Nome do Amigo (Pet)

# pet_tutor_name_label
source: Tutor's Name
pt: Nome do Tutor(a)

# pet_friend_new
source: New Friend
pt: Novo Amigo

# pet_friend_select
source: Select a friend
pt: Selecione um amigo

# error_generic_title
source: Oops! Something didn't go as expected
pt: Ops! Algo não saiu como esperado

# error_generic_message
source: The system had a little technical hiccup. We are already looking into it!
pt: O sistema teve um pequeno tropeço técnico. Já estamos verificando!

# error_button_retry
source: Try Again
pt: Tentar Novamente

# error_unknown
source: Unknown
pt: Desconhecido

# pdf_report_disclaimer
source: Report generated automatically by ScanNut+ AI. Always consult a veterinarian.
pt: Relatório gerado automaticamente por ScanNut+ IA. Consulte sempre um veterinário.

# pdf_analysis_report
source: ANALYSIS REPORT
pt: RELATÓRIO DE ANÁLISE

# pdf_part
source: PART
pt: PARTE

# pdf_references_sources
source: REFERENCES & SOURCES
pt: REFERÊNCIAS & FONTES

# pdf_title_label
source: TITLE:
pt: TÍTULO:

# pdf_content_label
source: CONTENT:
pt: CONTEÚDO:

# pdf_icon_label
source: ICON:
pt: ÍCONE:

# ocr_scan_title
source: Exam Scan
pt: Digitalização de Exame

# action_generate_pdf
source: Generate PDF
pt: Gerar PDF

# ocr_extracted_data_title
source: EXTRACTED EXAM DATA
pt: DADOS EXTRAÍDOS DO EXAME

# ocr_extracted_item
source: Extracted Data
pt: Dado Extraído

# ocr_scientific_sources
source: Scientific & Regulatory Sources
pt: Fontes Científicas & Regulatórias

# pdf_unknown_pet
source: Unknown Pet
pt: Pet Desconhecido

# pdf_unknown_breed
source: Unknown Breed
pt: Raça Desconhecida

# pdf_scannut_report
source: ScanNut+ Report
pt: Relatório ScanNut+

# pdf_scientific_references
source: Scientific References:
pt: Referências Científicas:

# pdf_master_protocol_2026
source: Master Protocol 2026
pt: Protocolo Master 2026

# pdf_section
source: Section
pt: Seção

# general_analysis
source: Analysis
pt: Análise

# general_scientific_sources
source: Scientific Sources
pt: Fontes Científicas

# help_journal_walk_guide
source: Journal / Walk Guide
pt: Guia do Diário / Passeio

# partner_filter_all
source: All
pt: Todos

# partner_filter_health
source: Health
pt: Saúde

# partner_filter_hospitality
source: Hospitality
pt: Hospitalidade

# partner_filter_aesthetics
source: Aesthetics
pt: Estética

# partner_filter_education
source: Education
pt: Educação

# partner_filter_services
source: Services
pt: Serviços

# error_location_disabled
source: Location services are disabled.
pt: Serviços de localização desativados.

# error_location_denied
source: Location permissions are denied
pt: Permissões de localização negadas

# error_location_permanently_denied
source: Location permissions are permanently denied.
pt: Permissões de localização permanentemente negadas.

# error_fetching_places
source: Error fetching places: {error}
pt: Erro ao buscar locais: {error}

# partner_about
source: About the Partner
pt: Sobre o Parceiro

# partner_network_search
source: Network Search
pt: Pesquisa de Rede

# partner_force_search_restart
source: Force search restart
pt: Forçar reinício da busca

# partner_syncing_contacts
source: Syncing contacts...
pt: Sincronizando contatos...

# partner_open_now
source: OPEN NOW
pt: ABERTO

# partner_select_this
source: SELECT THIS PARTNER
pt: SELECIONAR ESTE PARCEIRO

# walk_no_notes
source: No notes
pt: Sem notas

# walk_error_generating_summary
source: Error generating summary: {error}
pt: Erro ao gerar resumo: {error}

# walk_ai_summary
source: AI Summary
pt: Resumo com IA

# walk_event_removed_success
source: Event successfully removed!
pt: Evento removido com sucesso!

# walk_error_deleting
source: Error deleting
pt: Erro ao deletar

# history_guest
source: Guest
pt: Visitante

# agenda_appointment
source: Appointment
pt: Compromisso

# metrics_registered_clinical
source: Registered Clinical Metrics
pt: Métricas Clínicas Registradas

# pdf_page_count
source: Page {page} of {total}
pt: Página {page} de {total}

# pdf_name
source: Name: {name}
pt: Nome: {name}

# pdf_breed
source: Breed: {breed}
pt: Raça: {breed}

# pdf_friend_present
source: Friend Present: {friendName}
pt: Amigo Presente: {friendName}

# pdf_tutor
source: Tutor: {tutorName}
pt: Tutor(a): {tutorName}

# pdf_date
source: Date: {date}
pt: Data: {date}

# walk_location_real_context
source: Location: {place} (Real Context)
pt: Local: {place} (Contexto Real)

# walk_weather_summary
source: Temperature: {temp}°C, {desc}. Humidity: {humidity}%.
pt: Temperatura: {temp}°C, {desc}. Umidade: {humidity}%.

# pet_nutrition_hybrid
source: Hybrid (Kibble + Fresh)
pt: Híbrida (Ração + Natural)

# pet_nutrition_maintain
source: Weight Maintenance
pt: Manter Peso (Equilíbrio)

# pet_nutrition_weight_loss
source: Weight Loss
pt: Perda de Peso

# pet_nutrition_muscle
source: Muscle Building
pt: Ganho de Massa

# pet_nutrition_therapeutic
source: Therapeutic/Disease
pt: Terapêutica/Doença

# pet_nutrition_exclusion
source: Exclusion Diet
pt: Dieta de Exclusão

# pet_nutrition_senior
source: Senior/Cognitive
pt: Sênior/Cognitivo

# pet_nutrition_puppy
source: Puppy/Kitten
pt: Filhote
