Repository: abreuretto72/ScanNutPlus
Catalog: lib/l10n/app_*.arb
Languages: pt

# login_subtitle
source: Access your digital wellness universe
pt: Acesse seu universo digital de bem-estar

# login_password_label
source: Password
pt: Senha

# login_password_hint
source: Password
pt: Senha

# login_confirm_password_hint
source: Confirm Password
pt: Confirmar Senha

# login_button_enter
source: Log In
pt: Entrar

# login_button_biometrics
source: Log In with Biometrics
pt: Entrar com Biometria

# login_keep_me
source: Keep me logged in
pt: Manter conectado

# login_no_account
source: Don't have an account?
pt: Não tem uma conta?

# login_sign_up
source: Sign Up
pt: Cadastre-se

# biometric_success
source: Biometrics verified successfully
pt: Biometria verificada com sucesso

# login_error_credentials
source: Invalid credentials
pt: Credenciais inválidas

# error_password_short
source: Password must be at least 8 characters
pt: A senha deve ter pelo menos 8 caracteres

# error_password_weak
source: Needs uppercase, number, and special char
pt: Requer maiúscula, número e caractere especial

# error_password_mismatch
source: Passwords do not match
pt: As senhas não coincidem

# pwd_help_title
source: Password Rules
pt: Regras de Senha

# pwd_rule_length
source: Minimum of 8 characters
pt: Mínimo de 8 caracteres

# pwd_rule_uppercase
source: At least one uppercase letter
pt: Pelo menos uma letra maiúscula

# pwd_rule_number
source: At least one number
pt: Pelo menos um número

# pwd_rule_special
source: At least one special character
pt: Pelo menos um caractere especial

# biometric_error
source: Biometric authentication failed
pt: Falha na autenticação biométrica

# biometric_reason
source: Scan to authenticate
pt: Escaneie para autenticar

# biometric_tooltip
source: Biometrics
pt: Biometria

# tabFood
source: Food
pt: Alimentos

# tabPlants
source: Plants
pt: Plantas

# home_title
source: Home
pt: Início

# home_welcome
source: Welcome Home
pt: Bem-vindo

# onboarding_title
source: Welcome to ScanNut+
pt: Bem-vindo ao ScanNut+

# onboarding_welcome
source: Your AI companion for food, plants, and pets.
pt: Seu companheiro de IA para alimentos, plantas e pets.

# onboarding_button_start
source: Get Started
pt: Começar

# onboarding_tou_title
source: Analytical Terms of Use
pt: Termos de Uso Analítico

# onboarding_tou_body
source: ScanNut+ provides you with an Artificial Intelligence-based Veterinary Specialist trained at a high cost. ⚠️ Attention: No image analysis is free. Processing each photo generates real operation costs. Therefore, we DO NOT pre-analyze images to save traffic and speed up response times. It is entirely your responsibility to be accurate in the selected category. Out-of-context photographs will generate absurd or out-of-context reports. Remember: AI is just a virtual assistant and can make mistakes. The generated report does not replace, under any circumstances, a face-to-face evaluation by a Veterinarian or Specialist. Always consult a trusted professional to evaluate exams.
pt: O ScanNut+ fornece a você um Especialista Veterinário baseado em Inteligência Artificial treinada em alto custo. ⚠️ Atenção: Nenhuma análise de imagem é de graça. O processamento de cada foto gera custos reais de operação. Por isso, NÃO analisamos previamente as imagens para poupar tráfego e acelerar a resposta. É de sua inteira responsabilidade ser preciso na categoria selecionada. Fotografias fora de contexto gerarão laudos absurdos ou fora de contexto. Lembre-se: A IA é apenas um assistente virtual e pode cometer erros. O laudo gerado não substitui, em hipótese alguma, a avaliação presencial de um Médico Veterinário ou Especialista. Consulte sempre um profissional de confiança para laudar exames.

# onboarding_tou_accept
source: I understand and agree
pt: Eu entendi e concordo

# home_welcome_user
source: Hello, {name}
pt: Olá, {name}

# common_logout
source: Logout
pt: Sair

# logout_success
source: Logged out successfully
pt: Desconectado com sucesso

# food_scan_title
source: Food Scanner
pt: Scanner de Alimentos

# food_analyzing
source: Analyzing nutritional content...
pt: Analisando informações nutricionais...

# food_analysis_success
source: Analysis Complete
pt: Análise Concluída

# food_calories
source: Calories
pt: Calorias

# food_protein
source: Protein
pt: Proteínas

# food_carbs
source: Carbs
pt: Carboidratos

# food_fat
source: Fat
pt: Gorduras

# food_btn_scan
source: Scan Food
pt: Escanear

# food_btn_gallery
source: Gallery
pt: Galeria

# food_empty_history
source: No food scans yet.
pt: Nenhum registro ainda.

# domain_pets_navigation
source: Pets Navigation
pt: Navegação Pet

# pets_navigation_subtitle
source: Pet Directions Assistant
pt: Assistente de Direção Pet

# menu_profile
source: Profile
pt: Perfil

# menu_settings
source: Settings
pt: Configurações

# menu_help
source: Help
pt: Ajuda

# stub_map_module
source: Map Module Coming Soon
pt: Módulo de Mapa em Breve

# user_demo_name
source: User Demo
pt: Usuário Demo

# user_default_name
source: User
pt: Usuário

# food_mock_grilled_chicken
source: Grilled Chicken Salad
pt: Salada de Frango Grelhado

# about_title
source: About
pt: Sobre

# version_label
source: Version
pt: Versão

# contact_label
source: Contact
pt: Contato

# profile_title
source: Profile
pt: Perfil

# profile_biometric_enable
source: Enable Biometric Auth
pt: Habilitar Biometria

# common_confirm_exit
source: Do you really want to exit?
pt: Deseja realmente sair?

# profile_change_password
source: Change Password
pt: Alterar Senha

# password_current
source: Current Password
pt: Senha Atual

# password_new
source: New Password
pt: Nova Senha

# password_confirm
source: Confirm Password
pt: Confirmar Senha

# password_save
source: Save New Password
pt: Salvar Nova Senha

# password_match_error
source: Passwords do not match
pt: As senhas não conferem

# password_success
source: Password changed successfully
pt: Senha alterada com sucesso

# default_user_name
source: User
pt: Usuário

# pet_capture_title
source: Pet Capture
pt: Captura Pet

# action_take_photo
source: Take Photo
pt: Tirar Foto

# action_upload_gallery
source: Upload from Gallery
pt: Upload da Galeria

# species_label
source: Species
pt: Espécie

# species_dog
source: Dog
pt: Cão

# species_cat
source: Cat
pt: Gato

# image_type_label
source: Image Type
pt: Tipo de Imagem

# type_pet
source: Pet
pt: Animal

# type_label
source: Food
pt: Alimentos

# pet_saved_success
source: Pet saved successfully
pt: Pet salvo com sucesso

# label_analysis_pending
source: Label analysis coming soon
pt: Análise de rótulo em breve

# action_retake
source: Retake
pt: Tentar Novamente

# label_name
source: Name
pt: Nome

# hint_user_name
source: Enter your name
pt: Digite seu nome

# section_account_data
source: Account Data
pt: Dados da Conta

# help_title
source: Help & Support
pt: Ajuda e Suporte

# help_how_to_use
source: How to Use
pt: Como Usar

# help_pet_scan_tip
source: Scan your pet or food labels for nutritional analysis.
pt: Escaneie seu pet ou rótulos de alimentos para análise nutricional.

# help_privacy_policy
source: Privacy Policy
pt: Política de Privacidade

# help_contact_support
source: Contact Support
pt: Contatar Suporte

# help_dev_info
source: Developed by Multiverso Digital
pt: Desenvolvido por Multiverso Digital

# help_privacy_content
source: Multiverso Digital and the ScanNut+ application have an absolute commitment to your privacy, in strict compliance with the General Data Protection Law (LGPD). All reports generated by Artificial Intelligence (including images, clinical exams, pet medical data, and location tracking) undergo a strict anonymization process before being transmitted for processing by the language model. The core processing (ObjectBox database) runs strictly locally (offline) on your device. Advanced AI and Image Recognition features query Gemini (Google) under a strict token confidentiality policy, where no user or patient (pet) data is stored on external servers for training purposes. ScanNut+ does not sell or mine your photos, voice, or schedule data. You can request the complete removal of your record via the official email. We respect your privacy.
pt: A Multiverso Digital e o aplicativo ScanNut+ têm compromisso absoluto com a sua privacidade, em conformidade com a Lei Geral de Proteção de Dados (LGPD). Todos os relatórios gerados por Inteligência Artificial (incluindo imagens, exames clínicos, dados médicos do pet e registros de localização) são submetidos a um processo de anonimização estrita antes de serem transmitidos para processamento pelo modelo de linguagem. O processamento base (banco de dados ObjectBox) ocorre estritamente de maneira local (offline) em seu dispositivo. Funcionalidades avançadas de Inteligência Artificial e Reconhecimento de Imagens consultam o Gemini (Google) sob rigorosa política de confidencialidade de tokens, onde nenhum dado do usuário ou paciente (pet) é armazenado em servidores externos para treinamento. O ScanNut+ não realiza venda ou mineração das suas fotos, voz ou dados de agenda. Você pode solicitar a remoção completa de seu cadastro pelo e-mail oficial.

# help_story_title
source: Our Story
pt: Nossa História

# help_origin_story
source: The name of this app is a tribute to my pet, Nut. My idea was to create a tool for complete management of his life, from routine organization to the creation of healthy menus. In daily life, ScanNut helps me record every occurrence. For stool, urine, and blood tests, I use AI to get initial insights through image analysis — a technological support I always share with the vet. Additionally, I included a plant guide to identify toxic species and ensure his safety. Thinking about my own health, I added the Food Scan to monitor calories, vitamins, and generate meal plans with shopping lists. I feel that, now, the app is complete for both of us.
pt: O nome deste app é uma homenagem ao meu pet, o Nut.

# help_analysis_guide_title
source: AI Analysis Guide
pt: Guia de Análise IA

# help_disclaimer
source: This analysis is visual only and does not replace a veterinary evaluation.
pt: A análise é apenas visual e não substitui avaliação veterinária.

# help_section_pet_title
source: General Pet Analysis
pt: Análise Geral do Pet

# help_section_pet_desc
source: Analyzes species, size estimate, body posture (pain/comfort signs), and environment safety.
pt: Analisa espécie, porte e postura.

# help_section_wound_title
source: Wounds & Injuries
pt: Feridas e Lesões

# help_section_wound_desc
source: Evaluates size, visual aspect (pus/blood presence), redness, and signs of inflammation.
pt: Avalia aspectos visuais de lesões.

# help_section_stool_title
source: Stool Analysis
pt: Análise de Fezes

# help_section_stool_desc
source: Checks consistency (Bristol scale), color changes, and visible presence of mucus or worms.
pt: Verifica consistência e cor.

# help_section_mouth_title
source: Dental & Mouth
pt: Boca e Dentes

# help_section_mouth_desc
source: Inspects gum color (pale/red), tartar buildup, and broken teeth indicators.
pt: Inspeciona dentes e gengiva.

# help_section_eyes_title
source: Eyes Health
pt: Saúde dos Olhos

# help_section_eyes_desc
source: Detects secretion, redness, cloudiness (opacity), and potential irritation signs.
pt: Detecta secreção e vermelhidão.

# help_section_skin_title
source: Skin & Coat
pt: Pele e Pelagem

# help_section_skin_desc
source: Identifies hair loss patches, redness, flakes, and unusual spots or lumps.
pt: Identifica falhas e descamação.

# help_can_do
source: What AI can detect
pt: O que a IA detecta

# help_cannot_do
source: Limit: Needs Vet confirmation
pt: Limite: Requer confirmação vet

# pet_capture_instructions
source: The AI analyzes images of the pet, wounds, stool, mouth, eyes, and skin. One at a time.
pt: A IA analisa imagens do pet individualmente.

# help_domain_pet_title
source: An exclusive AI for your Pet.
pt: Uma IA exclusiva para o seu Pet.

# help_domain_pet_desc
source: Your pet has an exclusive intelligence in ScanNut+! Our AI analyzes all collected data to answer your questions and generate detailed health reports. In addition, you can perform visual image analysis to closely monitor your best friend's well-being. You can also perform the same analyses for your pet's friend. Give your best friend a voice! With ScanNut+'s exclusive AI, you can clarify all your doubts and receive health reports based on your pet's daily life. Also use our image analysis to understand what photos tell about their health and behavior. ScanNut+ offers a smart assistant dedicated to your pet. It transforms data and photos into health reports and immediate answers to your questions. Everything to ensure your friend is always well cared for.
pt: Seu pet conta com uma inteligência exclusiva no ScanNut+! Nossa IA analisa todos os dados coletados para responder suas dúvidas e gerar relatórios detalhados sobre a saúde dele. Além disso, você pode realizar análises visuais por imagem para acompanhar de perto o bem-estar do seu grande amigo. Você pode ainda fazer as mesmas análises para o amigo do seu pet. Dê uma voz ao seu melhor amigo! Com a IA exclusiva do ScanNut+, você tira todas as suas dúvidas e recebe relatórios de saúde baseados no dia a dia do seu pet. Use também a nossa análise de imagens para entender o que as fotos contam sobre a saúde e o comportamento dele. O ScanNut+ oferece um assistente inteligente dedicado ao seu pet. Ele transforma dados e fotos em relatórios de saúde e respostas imediatas para suas perguntas. Tudo para garantir que seu amigo esteja sempre bem cuidado.

# help_domain_food_title
source: Food Domain
pt: Domínio Food

# help_domain_food_desc
source: Your health management: Food scanning, nutrient counting, and healthy meal plan creation.
pt: Gestão da sua saúde nutricional.

# help_domain_plant_title
source: Plant Domain
pt: Domínio Plant

# help_domain_plant_desc
source: Plant Guide: Identify species in your garden or home and know instantly if they are toxic to your pet, based on real botanical data.
pt: Identifique plantas tóxicas.

# pet_capture_info_title
source: ScanNut+ AI Capabilities
pt: Recursos IA ScanNut+

# pet_capture_capability_labels
source: Food Label & Ingredient Analysis
pt: Análise de Rótulos

# pet_capture_capability_exams
source: Clinical Reports & Lab Exams
pt: Laudos Clínicos

# pet_capture_capability_biometrics
source: Posture & Biometric Monitoring
pt: Monitoramento Postura

# pet_input_name_hint
source: What is the pet's name?
pt: Qual o nome do pet?

# pet_result_status_stable
source: Status: Stable
pt: Status: Estável

# pet_result_summary_title
source: Analysis Summary
pt: Resumo da Análise

# pet_result_visual_empty
source: No visual anomalies detected
pt: Sem anomalias visuais detectadas

# pet_med_drug_name
source: Drug Name
pt: Nome do Remédio

# pet_med_dosage
source: Dosage
pt: Dosagem

# pet_med_unit
source: Unit
pt: Unidade

# pet_med_route
source: Route
pt: Via de Adm.

# pet_med_injectable
source: Injectable
pt: Injetável

# pet_med_topical
source: Topical
pt: Tópica

# pet_med_drops
source: Drops
pt: Colírio/Gotas

# pet_med_duration
source: Duration (Days)
pt: Duração (Dias)

# pet_med_interval
source: Interval (Hours)
pt: Intervalo (Horas)

# pet_med_duration_help
source: How many days will the treatment last?
pt: Quantos dias o tratamento vai durar?

# pet_med_interval_help
source: Every how many hours should the pet take the dose?
pt: A cada quantas horas a dose deve ser dada?

# pet_med_dosage_help
source: Amount to be given per dose?
pt: Quantidade a ser administrada por dose.

# pet_agenda_event_date_help
source: Treatment start date.
pt: Data de início do tratamento.

# pet_field_time_help
source: Time of the first dose.
pt: Horário da primeira dose.

# pet_med_start_date
source: Start Date
pt: Data Inicial

# pet_med_start_time
source: Start Time
pt: Horário Inicial

# pet_med_save
source: Schedule Treatment
pt: Agendar Tratamento

# pet_med_take_dose
source: Take Dose
pt: Dar Dose

# pet_med_empty_error
source: Drug name is required.
pt: O nome do remédio é obrigatório.

# pet_med_success
source: Medication scheduled successfully!
pt: Medicação agendada com sucesso!

# pet_med_taken_success
source: Dose recorded successfully!
pt: Dose registrada com sucesso!

# pet_nutrition_history_title
source: Nutrition History
pt: Histórico Nutricional

# pet_nutrition_empty_history
source: No plans generated yet.
pt: Nenhum plano gerado ainda.

# pet_analysis_error_generic
source: We had a slight technical difficulty during the analysis. Please try again. ({error})
pt: Tivemos uma pequena dificuldade técnica na análise. Tente novamente! ({error})

# pet_urgency_red
source: urgency: red
pt: Urgência: Crítico

# pet_urgency_immediate
source: immediate attention
pt: Atenção Imediata

# pet_urgency_critical
source: critical
pt: Crítico

# pet_urgency_yellow
source: urgency: yellow
pt: Urgência: Atenção

# pet_urgency_monitor
source: monitor
pt: Monitorar

# pet_status_critical
source: Status: Critical Attention
pt: Status: Atenção Crítica

# pet_status_monitor
source: Status: Monitor
pt: Status: Monitorar

# pet_mock_visual_confirm
source: Visual analysis confirms structure...
pt: Análise visual confirmada.

# key_green
source: Monitor
pt: Monitorar

# key_yellow
source: Attention
pt: Atenção

# key_red
source: Critical
pt: Crítico

# value_unknown
source: Unknown
pt: Desconhecido

# error_database_load
source: We couldn't access your data right now. How about trying again? ({error})
pt: Não conseguimos acessar seus dados agora. Tente novamente! ({error})

# pet_section_body
source: Body Conditions
pt: Corpo

# pet_section_eyes
source: Eyes
pt: Olhos

# pet_section_mouth
source: Mouth
pt: Boca

# pet_action_share
source: Share
pt: Compartilhar

# source_merck
source: Merck Veterinary Manual (MSD Digital 2026)
pt: Manual Veterinário Merck 2026

# source_scannut
source: ScanNut+ Biometry & Phenotyping Protocol
pt: Protocolo ScanNut+

# source_aaha
source: AAHA/WSAVA Physical Exam Guidelines
pt: Diretrizes AAHA/WSAVA

# pet_section_posture
source: Posture
pt: Postura

# pet_section_exams
source: Exams
pt: Exames

# category_feces
source: Stool
pt: Fezes

# category_food_label
source: Food Label
pt: Alimentos

# pet_type_general
source: General
pt: Geral

# category_wound
source: Wound
pt: Ferida

# pet_dialog_new_title
source: New Profile
pt: Novo Perfil

# category_clinical
source: Clinical
pt: Clínico

# category_lab
source: Lab
pt: Laboratório

# pet_section_general
source: General Analysis
pt: Análise Geral

# pet_section_visual
source: Visual Inspection
pt: Inspeção Visual

# pet_section_biometrics
source: Biometrics
pt: Biometria

# pet_section_weight
source: Weight
pt: Peso

# pet_ui_my_pets
source: My Pets
pt: Meus Pets

# pet_my_pets_title
source: My Pets
pt: Meus Pets

# pet_no_pets_registered
source: No pets registered yet.
pt: Nenhum pet registrado.

# pet_dashboard_title
source: Pet Dashboard
pt: Painel do Pet

# pet_action_biometrics
source: Biometrics
pt: Biometria

# pet_action_history
source: Analysis history
pt: Prontuário

# pet_type_label
source: Food
pt: Alimentos

# pet_type_wound
source: Wound
pt: Ferida

# pet_type_stool
source: Stool
pt: Fezes

# pet_type_mouth
source: Mouth
pt: Boca/Dentes

# pet_type_eyes
source: Eyes
pt: Olhos

# pet_type_skin
source: Skin
pt: Pele/Pelo

# pet_type_lab
source: Lab Results
pt: Exame Lab

# pet_select_context
source: Select analysis type:
pt: Selecione o tipo de análise:

# pet_unknown
source: Unknown
pt: Desconhecido

# pet_analyzing_x
source: Analyzing: {name}
pt: Analisando: {name}

# pet_type_safety
source: Safety
pt: Segurança

# pet_type_new_profile
source: New Profile
pt: Novo Perfil

# pet_waze_title
source: Pet Waze
pt: Waze Pet

# pet_waze_desc
source: Community alerts near you
pt: Alertas da comunidade

# pet_partners_title
source: Partners
pt: Parceiros

# pet_partners_desc
source: Discounts and services
pt: Descontos e serviços

# pet_tab_history
source: History
pt: Histórico

# pet_appointment_new_partner
source: [New Partner]
pt: [Novo Parceiro]

# pet_appointment_searching_partners
source: Searching nearby partners...
pt: Buscando parceiros próximos...

# pet_appointment_manual_entry
source: Enter Manually
pt: Preencher Manualmente

# pet_appointment_no_partner_title
source: No Partner Selected
pt: Parceiro não informado

# pet_appointment_no_partner_msg
source: You haven't specified a location or professional. Do you want to save the appointment anyway?
pt: Você não informou o local ou o profissional. Deseja salvar o compromisso mesmo assim?

# pet_appointment_no_partner_confirm
source: Save without partner
pt: Salvar sem parceiro

# pet_history_empty
source: No history available
pt: Histórico vazio

# pet_analysis_result_title
source: Analysis Result
pt: Resultado

# pet_status_healthy_simple
source: Healthy
pt: Saudável

# pet_status_critical_simple
source: Critical
pt: Crítico

# pet_status_attention_simple
source: Attention
pt: Atenção

# pet_section_sources
source: References & Protocol
pt: Referências

# pet_action_new_analysis
source: New Analysis
pt: Analisar

# source_scannut_db
source: ScanNut+ Database
pt: Banco ScanNut+

# pet_unknown_name
source: Unnamed
pt: Sem Nome

# pet_footer_brand
source: ScanNut+ Pet Intelligence
pt: Inteligência Pet ScanNut+

# pet_history_title
source: Analysis History
pt: Histórico de Análises

# pet_breed_unknown
source: Unknown Breed
pt: Raça não informada

# pet_label_breed
source: Breed
pt: Raça

# pet_label_sex
source: Sex
pt: Sexo

# pet_sex_male
source: Male
pt: Macho

# pet_sex_female
source: Female
pt: Fêmea

# pet_delete_title
source: Delete Pet
pt: Excluir Pet

# pet_delete_content
source: Are you sure you want to delete this pet and all its history?
pt: Deseja realmente excluir?

# pet_delete_confirm
source: Delete
pt: Excluir

# pet_delete_cancel
source: Cancel
pt: Cancelar

# pet_history_delete_success
source: History deleted successfully!
pt: Histórico excluído

# pet_ai_overloaded_message
source: AI overloaded! Please try again in a few moments.
pt: IA sobrecarregada!

# pet_delete_success
source: Pet deleted successfully
pt: Pet excluído

# pet_recent_analyses
source: Recent Analyses
pt: Últimas Análises

# pet_no_history
source: No recent analyses.
pt: Sem análises.

# pet_new_pet
source: New Pet
pt: Novo Pet

# val_unknown_date
source: Unknown Date
pt: Data Desconhecida

# report_generated_on
source: Generated on
pt: Gerado em

# pet_analysis_skin
source: Skin & Coat
pt: Pele e Pelagem

# pet_analysis_mouth
source: Oral Health
pt: Saúde Bucal

# pet_analysis_stool
source: Stool Screening
pt: Fezes

# pet_analysis_lab
source: Lab Report Reading
pt: Exames

# pet_analysis_label
source: Nutrition & Labels
pt: Nutricional

# pet_analysis_posture
source: Body Condition
pt: Condição Corporal

# ai_feedback_no_oral_layout
source: No oral structures visible for analysis.
pt: Sem estrutura oral visível.

# ai_feedback_no_derm_abnormalities
source: No dermatological abnormalities detected based on visual evidence.
pt: Sem anormalidades de pele.

# ai_feedback_invalid_gastro
source: INVALID_CONTEXT: Image does not appear to be gastrointestinal output.
pt: Imagem não é conteúdo gastrointestinal.

# ai_feedback_invalid_lab
source: INVALID_CONTEXT: Image is not a lab report.
pt: Imagem não é exame laboratorial.

# ai_feedback_lab_disclaimer
source: Interpretation is based on visible text. Verify with original document.
pt: Verifique o documento original.

# ai_feedback_eyes_not_visible
source: Eyes not fully visible.
pt: Olhos não visíveis.

# ai_feedback_inconclusive_angle
source: Inconclusive visual angle.
pt: Ângulo inconclusivo.

# pet_module_dentistry
source: Oral Health (Teeth & Gums)
pt: Saúde Bucal

# pet_module_dermatology
source: Skin, Coat & Wounds
pt: Pele e Pelagem
