Repository: abreuretto72/ScanNutPlus
Catalog: lib/l10n/app_*.arb
Languages: pt

# pet_module_gastro
source: Stool & Digestion
pt: Digestão

# pet_module_lab
source: Lab Report Reading
pt: Laboratório

# pet_module_nutrition
source: Labels
pt: Rótulos

# pet_module_ophthalmology
source: Ophthalmology (Eyes)
pt: Oftalmologia

# pet_module_physique
source: Body Condition & Weight
pt: Condição Corporal

# btn_scan_image
source: Scan Image
pt: Escanear

# generic_analyzing
source: Analyzing...
pt: Analisando...

# pet_error_image_not_found
source: Image not found.
pt: Imagem não encontrada.

# btn_go
source: Go
pt: Ir

# pet_created_at_label
source: Created at
pt: Criado em

# pet_initial_assessment
source: New Profile
pt: Novo Perfil

# pet_hint_select_type
source: Select Type
pt: Selecione

# pet_label_info
source: Info
pt: Informação

# pet_type_profile
source: Profile
pt: Perfil

# pet_action_analyses
source: Analyses
pt: Análises

# pet_action_profile_short
source: Profile
pt: Perfil

# pet_action_health
source: Health
pt: Saúde

# pet_action_walk
source: Walk
pt: Passeio

# pet_profile_title
source: Pet Profile
pt: Perfil do Pet

# pet_management_title
source: Management
pt: Gestão

# pet_label_health_plan
source: Health Plan
pt: Plano de Saúde

# pet_label_funeral_plan
source: Funeral Plan
pt: Plano Funerário

# pet_label_weight
source: Weight
pt: Peso

# pet_label_size
source: Size
pt: Porte

# pet_label_neutered
source: Neutered
pt: Castrado

# pet_label_birth_date
source: Birth Date
pt: Nascimento

# pet_btn_add_metric
source: Add Metric
pt: Métrica

# pet_agenda_add_event
source: Add Event
pt: Adicionar evento

# error_unexpected_title
source: Unexpected Error
pt: Erro Inesperado

# error_unexpected_message
source: We had a little technical issue. We're working on fixing it.
pt: Tivemos um probleminha técnico. Estamos trabalhando para resolver.

# error_try_recover
source: Recover
pt: Recuperar

# pet_profile_save_success
source: Profile saved
pt: Perfil atualizado

# pet_action_save_profile
source: SAVE PROFILE
pt: SALVAR PERFIL

# pet_metric_title
source: Clinical Metrics
pt: Métricas Clínicas

# pet_metric_section_vitals
source: 1. Vital and Clinical Signs
pt: 1. Sinais Vitais e Clínicos

# pet_metric_weight
source: Body Weight (kg)
pt: Peso Corporal (kg)

# pet_metric_bpm
source: Heart Rate (BPM)
pt: Freq. Cardíaca (BPM)

# pet_metric_mpm
source: Respiratory Rate (MPM)
pt: Freq. Respiratória (MPM)

# pet_metric_temp
source: Rectal Temperature (°C)
pt: Temperatura Retal (°C)

# pet_metric_tpc
source: Capillary Refill Time (Secs)
pt: Tempo de Preenchimento Capilar (Segs)

# pet_metric_glycemia
source: Glycemia Level (mg/dL)
pt: Nível de Glicemia (mg/dL)

# pet_metric_section_structure
source: 2. Structure and Composition
pt: 2. Estrutura e Composição

# pet_metric_ecc
source: Body Condition Score (1 to 9)
pt: Escore Condição Corporal (1 a 9)

# pet_metric_abd_circ
source: Abdominal Circumference (cm)
pt: Circunferência Abdominal (cm)

# pet_metric_neck_circ
source: Neck Circumference (cm)
pt: Circunferência do Pescoço (cm)

# pet_metric_height
source: Height at Withers (cm)
pt: Altura Cernelha (cm)

# pet_metric_section_hydration
source: 3. Hydration and Excretion
pt: 3. Hidratação e Excreção

# pet_metric_water
source: Water Intake (ml/24h)
pt: Ingestão de Água (ml/24h)

# pet_metric_urine_vol
source: Urinary Volume (ml or Text)
pt: Volume Urinário (ml ou Texto)

# pet_metric_urine_dens
source: Urine Specific Gravity
pt: Densidade Urinária

# pet_metric_section_activity
source: 4. Activity and Biometrics
pt: 4. Atividade e Biometria

# pet_metric_distance
source: Distance Traveled (km)
pt: Distância Percorrida (km)

# pet_metric_speed
source: Average Speed (km/h)
pt: Velocidade Média (km/h)

# pet_metric_sleep
source: Sleep/Rest Time (hours)
pt: Tempo de Sono/Repouso (horas)

# pet_metric_stand_latency
source: Stand Latency (seconds)
pt: Latência para Levantar (segundos)

# pet_metric_save_success
source: Metrics saved successfully!
pt: Métricas salvas com sucesso!

# pet_metric_source_clinical
source: Origin: Recorded in Clinical Metrics
pt: Origem: Registrado em Métricas Clínicas

# pet_metric_empty_fields
source: Please fill in at least one metric.
pt: Por favor, preencha pelo menos uma métrica.

source: Pet not found
pt: Pet não encontrado

# pet_plans_title
source: Plans
pt: Planos

# pet_action_manage_health_plan
source: Manage Health Plan
pt: Saúde

# health_plan_title
source: Health Plan
pt: Plano de Saúde

# health_plan_section_identification
source: 1. Identification
pt: 1. Identificação

# health_plan_section_coverages
source: 2. Coverages
pt: 2. Coberturas

# health_plan_section_limits
source: 3. Rules
pt: 3. Regras

# health_plan_section_support
source: 4. Support
pt: 4. Suporte

# health_plan_saved_success
source: Health plan saved!
pt: Salvo!

# health_plan_action_save
source: SAVE
pt: SALVAR

# health_plan_label_operator
source: Operator
pt: Operadora

# health_plan_label_plan_name
source: Name
pt: Nome

# health_plan_label_card_number
source: Card Number
pt: Carteirinha

# health_plan_label_holder_name
source: Holder
pt: Titular

# health_plan_label_grace_period
source: Grace Period
pt: Carência

# health_plan_label_annual_limit
source: Limit
pt: Limite

# health_plan_label_copay
source: Copay
pt: Copart.

# health_plan_label_reimburse
source: Reimburse
pt: Reembolso

# health_plan_label_deductible
source: Deductible
pt: Franquia

# health_plan_label_main_clinic
source: Clinic
pt: Clínica

# health_plan_label_city
source: City
pt: Cidade

# health_plan_label_phone
source: Phone
pt: Telefone

# health_cov_consultations
source: Consultations
pt: Consultas

# health_cov_vaccines
source: Vaccines
pt: Vacinas

# health_cov_lab_exams
source: Lab Exams
pt: Exames Lab

# health_cov_imaging
source: Imaging
pt: Imagem

# health_cov_surgery
source: Surgery
pt: Cirurgia

# health_cov_hospitalization
source: Hospitalization
pt: Internação

# health_cov_emergency
source: Emergency
pt: Emergência

# health_cov_pre_existing
source: Pre-existing
pt: Pré-existentes

# health_cov_dentistry
source: Dentistry
pt: Odonto

# health_cov_physiotherapy
source: Physio
pt: Fisio

# pet_db_sync_error
source: Sync Error
pt: Erro de Sincronização

# funeral_plan_title
source: Funeral Plan
pt: Plano Funerário

# funeral_section_identity
source: 1. Identification
pt: 1. Identificação

# funeral_section_services
source: 2. Services
pt: 2. Serviços

# funeral_section_rules
source: 3. Rules
pt: 3. Regras

# funeral_section_emergency
source: 4. EMERGENCY
pt: 4. EMERGÊNCIA

# funeral_label_company
source: Company
pt: Empresa

# funeral_label_plan_name
source: Plan
pt: Plano

# funeral_label_contract
source: Contract
pt: Contrato

# funeral_label_start_date
source: Start
pt: Início

# funeral_label_grace_period
source: Grace Period
pt: Carência

# funeral_label_max_weight
source: Max Weight
pt: Peso Máx

# funeral_label_phone
source: Phone
pt: Telefone

# funeral_label_value
source: Value
pt: Valor

# funeral_label_extra_fees
source: Fees
pt: Taxas

# funeral_svc_removal
source: Removal
pt: Remoção

# funeral_svc_viewing
source: Viewing
pt: Velório

# funeral_svc_cremation_ind
source: Cremation Ind.
pt: Cremação Ind.

# funeral_svc_cremation_col
source: Cremation Col.
pt: Cremação Col.

# funeral_svc_burial
source: Burial
pt: Enterro

# funeral_svc_urn
source: Urn
pt: Urna

# funeral_svc_ashes
source: Ashes
pt: Cinzas

# funeral_svc_certificate
source: Certificate
pt: Certificado

# funeral_action_call_emergency
source: EMERGENCY
pt: EMERGÊNCIA

# funeral_action_save
source: SAVE
pt: SALVAR

# funeral_save_success
source: Saved!
pt: Salvo!

# pet_history_button
source: History
pt: Histórico

# ai_assistant_title
source: AI {name}
pt: IA {name}

# ai_input_hint
source: Ask here...
pt: Pergunte aqui...

# ai_listening
source: Listening...
pt: Ouvindo...

# ai_error_mic
source: Mic denied
pt: Microfone negado

# ai_thinking
source: Thinking...
pt: Pensando...

# pet_age_years
source: {count, plural, =1{1 year} other{{count} years}}
pt: {count, plural, =1{1 ano} other{{count} anos}}

# pet_age_months
source: {count, plural, =1{1 month} other{{count} months}}
pt: {count, plural, =1{1 mês} other{{count} meses}}

# pet_age_estimate_label
source: Est. Age:
pt: Idade estimada:

# pet_size_small
source: Small
pt: Pequeno

# pet_size_medium
source: Medium
pt: Médio

# pet_size_large
source: Large
pt: Grande

# pet_label_estimated_weight
source: Est. Weight
pt: Peso estimado

# pet_clinical_title
source: Clinical Conditions
pt: Clínico

# pet_label_allergies
source: Allergies
pt: Alergias

# pet_label_chronic
source: Chronic Conditions
pt: Doenças crônicas

# pet_label_disabilities
source: Disabilities
pt: Deficiências

# pet_label_observations
source: Notes
pt: Notas

# pet_id_external_title
source: External ID
pt: ID Externo

# pet_label_registry
source: Registry ID
pt: Registro

# pet_qrcode_future
source: Coming Soon
pt: Em breve

# pet_analyses_title
source: Analyses: {name}
pt: Análises: {name}

# pet_profile_title_dynamic
source: Profile: {name}
pt: Perfil: {name}

# pet_health_title
source: Health: {name}
pt: Saúde: {name}

# pet_health_plan_title
source: Health Plan: {name}
pt: Plano Saúde: {name}

# pet_funeral_plan_title
source: Funeral Plan: {name}
pt: Plano Funeral: {name}

# pet_event_type_food
source: Nutrition
pt: Nutrição

# pet_event_type_health
source: Health
pt: Saúde

# pet_event_type_weight
source: Weight
pt: Peso

# pet_event_type_hygiene
source: Hygiene
pt: Higiene

# pet_event_type_activity
source: Walks
pt: Passeios

# pet_event_type_ai_chat
source: AI Chat
pt: Chat IA

# pet_event_type_appointment
source: Appointments
pt: Compromissos

# pet_event_type_partner
source: Partners
pt: Parceiros

# pet_event_type_behavior
source: Behavior
pt: Comportamento

# pet_event_type_plant
source: Plants
pt: Plantas

# pet_analysis_visual_title
source: Visual Analysis
pt: Análise Visual

# pet_event_type_other
source: Other
pt: Outros

# pet_agenda_coming_soon
source: Agenda Module for {name}
pt: Módulo Agenda para {name}

# pet_medical_history_empty
source: No medical history.
pt: Sem histórico médico.

# pet_share_not_implemented
source: Coming soon.
pt: Em breve.

# pet_ai_brain_not_ready
source: AI loading...
pt: IA carregando...

# pet_ai_connection_error
source: AI Error: {error}
pt: Erro IA: {error}

# pet_ai_trouble_thinking
source: Trouble processing.
pt: Dificuldade em processar.

# pet_stt_not_available
source: STT unavailable
pt: STT indisponível

# pet_stt_error
source: STT Error: {error}
pt: STT Erro: {error}

# pet_entry_deleted
source: Deleted
pt: Excluído

# pet_error_history_load
source: History Error: {error}
pt: Erro Histórico: {error}

# pet_ai_greeting
source: Hi! I am {name}'s AI.
pt: Olá! Sou a IA do {name}.

# tab_food
source: Food
pt: Alimentos

# tab_plant
source: Plants
pt: Plantas

# pet_section_species
source: Species Identification
pt: Espécie

# pet_section_health
source: General Health & Behavior
pt: Saúde Geral

# pet_section_coat
source: General Coat Condition
pt: Pelagem

# pet_section_skin
source: Skin Appearance
pt: Pele

# pet_section_ears
source: Ears
pt: Ouvidos

# pet_section_nose
source: Nose
pt: Nariz

# pet_section_issues
source: Potential Issues
pt: Alertas

# pet_status_healthy
source: HEALTHY STATUS
pt: SAUDÁVEL

# pet_status_attention
source: ATTENTION REQUIRED
pt: ATENÇÃO

# pet_event_food
source: Food
pt: Nutrição

# pet_event_health
source: Health
pt: Saúde

# pet_event_weight
source: Weight
pt: Peso

# pet_event_walk
source: Walk
pt: Passeio

# pet_event_appointment
source: Appointment
pt: Compromisso

# pet_event_partner
source: Partner
pt: Parceiro

# pet_event_behavior
source: Behavior
pt: Comportamento

# pet_event_ai_chat
source: AI Chat
pt: Chat IA

# pet_event_hygiene
source: Bath
pt: Banho

# pet_event_medication
source: Meds
pt: Remédio

# pet_event_note
source: Note
pt: Nota

# pet_ai_thinking_status
source: AI Thinking...
pt: IA Pensando...

# pet_walk_title_dynamic
source: Walk: {petName}
pt: Passeio: {petName}

# pet_friend_walk_title_dynamic
source: Friend Walk: {petName}
pt: Passeio Amigo: {petName}

# pet_agenda_empty
source: Empty Agenda
pt: Agenda vazia

# pet_agenda_add_event_dynamic
source: Event for {petName}
pt: Evento para {petName}

# pet_agenda_today
source: Today
pt: Hoje

# pet_agenda_yesterday
source: Yesterday
pt: Ontem

# pet_agenda_view_calendar
source: View Calendar
pt: Ver Calendário

# pet_agenda_select_type
source: Type
pt: Tipo

# pet_agenda_event_date
source: Date
pt: Data

# pet_agenda_event_time
source: Time
pt: Hora

# pet_agenda_notes_hint
source: Notes
pt: Notas

# pet_agenda_save
source: Save
pt: Salvar

# pet_journal_add_event
source: Journal {petName}
pt: Diário {petName}

# pet_journal_question
source: What happened?
pt: O que houve?

# pet_journal_placeholder
source: Describe...
pt: Descreva...

# pet_journal_register
source: Register
pt: Registrar

# label_friend_name
source: Friend
pt: Amigo

# pet_friend_prefix
source: Friend
pt: Amigo

# pet_friend_of_prefix
source: Friend of
pt: Amigo do

# pdf_friend_name_prefix
source: Friend's name
pt: Nome do amigo

# pdf_my_pet_name_prefix
source: My pet's name
pt: Nome do meu pet

# ai_simulating_analysis
source: Analyzing...
pt: Analisando...

# pet_journal_location_captured
source: Location saved
pt: Local salvo

# pet_journal_audio_recording
source: Recording...
pt: Gravando...

# pet_journal_audio_saved
source: Audio saved successfully
pt: Áudio salvo

# ai_audio_analysis_cough_detected
source: Cough detected.
pt: Tosse detectada.

# ai_suggest_health_category
source: Health?
pt: Saúde?

# pet_journal_location_name_simulated
source: Simulated Loc
pt: Local simulado

# journal_guide_title
source: AI Journal
pt: IA Diário

# journal_guide_voice
source: Speak and AI organizes.
pt: Fale e a IA organiza.

# journal_guide_camera
source: Analyze photos.
pt: Analise fotos.

# journal_guide_audio
source: Record clinical sounds.
pt: Grave sons clínicos.

# journal_guide_location
source: Log location.
pt: Registre o local.

# common_new
source: New
pt: Novo

# pet_journal_analyzed_by_nano
source: Nano Banana Analysis
pt: Análise Nano Banana

# pet_journal_social_context
source: Social Context
pt: Contexto Social

# journal_guide_unlock_hint
source: Start reporting.
pt: Comece relatando.

# pet_journal_mic_permission_denied
source: Mic denied.
pt: Microfone negado.

# label_relate
source: Report
pt: Relatar

# label_photo
source: Photo
pt: Foto

# label_place
source: Place
pt: Local

# label_audio
source: Audio
pt: Áudio

# label_sounds
source: Sounds
pt: Sons

# label_vocal
source: Vocalization
pt: Vocalização

# label_alert
source: Alert
pt: Alerta

# alert_poison
source: Poison
pt: Veneno

# alert_dog_loose
source: Angry Dog
pt: Cão Bravo

# alert_risk_area
source: Danger
pt: Perigo

# alert_noise
source: Noise
pt: Barulho

# error_gps
source: We couldn't locate your device right now. Please check your connection ({error})
pt: Não conseguimos localizar seu dispositivo agora. Verifique a conexão ({error})

# gps_error_snack
source: GPS Error.
pt: Erro GPS.

# map_type_normal
source: Normal
pt: Padrão

# map_type_satellite
source: Satellite
pt: Satélite

# map_type_hybrid
source: Hybrid
pt: Híbrido

# map_type_terrain
source: Terrain
pt: Terreno

# label_map_type
source: Map
pt: Mapa

# pet_journal_hint_text
source: Write here...
pt: Escreva aqui...

# pet_journal_register_button
source: Register
pt: Registrar

# pet_journal_report_action
source: Show
pt: Mostrar

# map_alert_title
source: Map Alert
pt: Reportar

# map_alert_dog
source: Angry Dog
pt: Cão Bravo

# map_alert_poison
source: Poison
pt: Veneno

# map_alert_noise
source: Noise
pt: Barulho

# map_alert_risk
source: Risk
pt: Risco

# map_alert_success
source: Success!
pt: Sucesso!

# pet_journal_recording
source: Recording journal...
pt: Gravando...

# pet_journal_photo_saved
source: Photo saved successfully
pt: Foto salva!

# pet_agenda_tab_scheduled
source: Appointments
pt: Compromissos

# pet_agenda_tab_timeline
source: History & Walks
pt: Histórico e Passeios

# map_alert_description_user
source: By user
pt: Pelo usuário

# pet_journal_gps_error
source: GPS Error
pt: Erro GPS

# pet_journal_location_unknown
source: Unknown
pt: Desconhecido

# pet_journal_location_approx
source: Approximate
pt: Aproximado

# label_gallery
source: Gallery
pt: Galeria

# label_file
source: File
pt: Arquivo

# pet_journal_file_selected
source: File: {name}
pt: Arquivo: {name}

# pet_journal_file_error
source: Error: {error}
pt: Erro: {error}

# pet_journal_help_title
source: How to use this screen?
pt: Como usar esta tela?

# pet_journal_help_photo_title
source: Camera & Gallery
pt: Câmera e Galeria

# pet_journal_help_photo_desc
source: Take a photo or choose one from your gallery. Use it to log wounds, feces, identify toxic plants on your path, or even analyze pet food labels, food photos, and lab test results. Our AI focuses on the image to generate deep technical analyses. Max size: 20MB.
pt: Tire uma foto na hora ou escolha da galeria. Use para registrar feridas, fezes, identificar plantas tóxicas no caminho, ou ainda analisar rótulos de ração, imagens de comida e resultados de exames laboratoriais. A nossa IA foca na imagem para gerar análises profundas. Limite: 20MB.

# pet_journal_help_audio_title
source: Sound Recorder
pt: Gravador de Sons

# pet_journal_help_audio_desc
source: Press and hold the microphone icon near the camera button to record ambient sounds, barks, cries, or coughing. The AI will listen to the audio to detect stress or pain signals. Max size: 20MB.
pt: Aperte e segure o ícone de microfone perto do botão de câmera para gravar sons do ambiente, como latidos, choros, tosses ou respiração ofegante. A inteligência artificial ouvirá o áudio para detectar sinais de estresse ou dor. Limite: 20MB.

# pet_journal_help_map_title
source: Map & Alerts
pt: Mapa e Alertas

# pet_journal_help_map_desc
source: The map automatically saves your current location. If you see danger on your route (like aggressive dogs or poison), tap the alert icon on the map to log it and warn the community.
pt: O mapa captura automaticamente o local do evento. Se você avistar algum perigo no trajeto (como cães agressivos, veneno ou lixo), clique no ícone de alerta no mapa para registrar e avisar a comunidade.

# pet_journal_help_notes_title
source: Notes & Voice Typing
pt: Anotações e Voz

# pet_journal_help_notes_desc
source: You can type details manually in the text box. If you prefer, tap the microphone inside the text field to just speak; the app will transcribe your words automatically.
pt: Você pode digitar os detalhes livremente na caixa de texto. Se preferir, clique no microfone dentro do campo de texto para falar. O aplicativo vai digitar tudo o que você disser automaticamente.

# pet_journal_help_videos_title
source: Short Videos
pt: Vídeos Curtos

# pet_journal_help_videos_desc
source: Record short clips directly in the app. This is perfect for showing the AI vet how your pet is walking (if they're limping) or to capture unusual behavior in motion. Max size: 20MB.
pt: Grave vídeos curtos direto pelo aplicativo. É perfeito para mostrar ao veterinário da IA como o pet está andando (caso esteja mancando) ou registrar um comportamento estranho em movimento. Limite: 20MB.

# pet_journal_help_ai_title
source: AI Veterinary Assistant
pt: Assistente de Veterinário IA

# pet_journal_help_ai_desc
source: When filling out any of the items above, our Artificial Intelligence acts as a veterinary assistant and analyzes the data on the spot! It generates a clinical summary in report format that is saved in your pet's history. Remember: the AI can make mistakes and a Veterinarian should always be consulted for diagnosis and treatment.
pt: Ao preencher qualquer um dos itens acima, nossa Inteligência Artificial atua como um assistente de veterinário e analisa os dados na hora! Ela gera um resumo clínico no formato de relatório que fica salvo no histórico do pet. Lembre-se: a IA pode cometer erros e um Médico Veterinário sempre deve ser consultado para diagnóstico e tratamento.

# pet_journal_help_friends_title
source: Walking with Friends
pt: Passeio com Amigos

# pet_journal_help_friends_desc
source: When the switch is on the friend, the app can perform all available analyses for the friend pet and also issue a PDF report.
pt: Quando a switch estiver no amigo, o app pode fazer todas as análises disponíveis do pet amigo e ainda emitir um relatório PDF.

# pet_journal_help_specialized_ai_title
source: Specialized Pet AI
pt: IA Especializada no seu Pet

# pet_journal_help_specialized_ai_desc
source: There is an Artificial Intelligence specially designed to know, learn, and understand all of your pet's data (like in Pet Chat). This allows it to answer anything you ask about your pet in a personalized way!
pt: Existe uma Inteligência Artificial especialmente desenvolvida para conhecer, aprender e entender todos os dados do seu pet (como no Pet Chat). Assim, ela é capaz de responder a tudo que você perguntar sobre ele de forma personalizada!

# btn_got_it
source: Got it
pt: Entendi

# help_guide_title
source: Help Guide
pt: Guia

# pet_journal_searching_address
source: Searching address...
pt: Endereço...

# pet_journal_address_not_found
source: Address not found
pt: Não achado

# pet_error_ai_analysis_failed
source: AI Error: {error}
pt: IA Erro: {error}

# pet_error_repository_failure
source: Oops, we couldn't save your changes at the moment ({status})
pt: Ops, não conseguimos salvar suas alterações no momento ({status})

# pet_error_saving_event
source: Save Error: {error}
pt: Salvar Erro: {error}

# pet_agenda_summary_format
source: {count} events
pt: {count} eventos

# common_delete_confirm_title
source: Confirm Delete
pt: Excluir?

# common_delete_confirm_message
source: Are you sure you want to delete?
pt: Deseja remover?

# common_cancel
source: Cancel
pt: Cancelar

# common_delete
source: Delete
pt: Excluir

# pet_error_delete_event
source: Delete Error
pt: Erro ao excluir

# pet_label_address
source: Address
pt: Endereço

# pet_label_ai_summary
source: AI Summary
pt: Resumo IA

# pet_analysis_data_not_found
source: No data.
pt: Sem dados.

# pet_logic_keywords_health
source: poop, feces, stool, pee, urine, vomit, diarrhea, blood, wound, injury, pain, limping, choking
pt: coco, cocô, fezes, xixi, urina, vomito, vômito, diarreia, sangue, machucado, ferida, dor, mancar, engasgo

# pet_expense_scan_btn
source: Scan Receipt
pt: Escanear Recibo

# pet_expense_gallery_btn
source: Gallery
pt: Galeria

# pet_expense_analyzing
source: Extracting values...
pt: Extraindo valores...

# pet_expense_ocr_success
source: Data extracted successfully!
pt: Dados extraídos com sucesso!

# pet_expense_ocr_failed
source: Failed to read receipt.
pt: Falha na leitura da nota.

# pet_ai_language
source: en_US
pt: pt_BR

# map_gps_disabled
source: Enable GPS.
pt: Ative o GPS.

# map_permission_denied
source: No permission.
pt: Sem permissão.

# map_permission_denied_forever
source: Open settings.
pt: Abra configurações.

# map_error_location
source: Error: {error}
pt: Erro: {error}

# map_title_pet_location
source: Location
pt: Localização

# action_open_settings
source: Settings
pt: Configurações

# map_sync_satellites
source: Satellites...
pt: Satélites...

# pet_module_ears
source: Ears
pt: Ouvidos

# pet_journal_audio_processing
source: Processing...
pt: Processando...

# pet_journal_audio_error_file_not_found
source: No audio.
pt: Sem áudio.

# pet_journal_audio_error_generic
source: No result.
pt: Sem resultado.

# pet_journal_audio_pending
source: Pending.
pt: Pendente.

# pet_journal_video_saved
source: Video saved successfully
pt: Vídeo salvo!

# pet_journal_video_processing
source: Analyzing...
pt: Analisando...

# pet_journal_video_error
source: Video Error.
pt: Erro vídeo.
